# Machine package manifest. Grouped by purpose. Apply with: brew bundle

tap "hashicorp/tap"

# Shell & terminal
brew "atuin"
brew "fzf"
brew "fzf-tab"
brew "starship"
brew "stow"
brew "tmux"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"

# CLI utilities
brew "bat"
brew "eza"
brew "fd"
brew "htop"
brew "jq"
brew "ripgrep"
brew "tree"
brew "wget"

# Git
brew "gh"
brew "git"

# Editors
brew "neovim"
cask "zed"

# Languages & package managers
brew "go"
brew "python@3.13"
npm "corepack"
npm "typescript"
npm "typescript-language-server"
uv "pip-audit"
uv "ruff"
uv "ty"

# Lint & static analysis
brew "actionlint"
brew "ast-grep"
brew "golangci-lint"
brew "shellcheck"
brew "shfmt"
brew "sqruff"
brew "zizmor"

# Dev workflow
brew "direnv"
brew "duti"
brew "goreleaser"
cask "docker-desktop"
cask "httpie-desktop"

# Cloud & infra
brew "cloud-sql-proxy"
brew "cloudflared"
brew "hashicorp/tap/terraform", trusted: true
cask "gcloud-cli"

# Databases
brew "mysql-client"
cask "db-browser-for-sqlite"
cask "sequel-ace"

# Media, docs & graphics
brew "ffmpeg"
brew "graphviz"
brew "imagemagick"
brew "pandoc"
brew "poppler"
brew "typst"
npm "pptxgenjs"

# Security & secrets
cask "1password"
cask "1password-cli"

# Quick Look plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "webpquicklook"

# Apps
cask "claude"
cask "firefox@developer-edition"
cask "libreoffice"
cask "slack"
cask "spotify"
cask "the-unarchiver"
